Repository: loginom/loginom-help-en-omegat
Catalog: omegat/project_save.tmx
Source language: ru
Languages: en

source: Во всех форматах: dd — день месяца в виде 2-х цифр, mm — номер месяца в виде 2-х цифр, yy — год в виде 2-х цифр, yyyy - год в виде 4-х цифр.
en: There are the following abbreviations in all formats: dd — day of the month in the form of 2 digits, mm — number of the month in the form of 2 digits, yy — year in the form of 2 digits, yyyy - year in the form of 4 digits.

source: Во всех форматах: h — часы без ведущего нуля, hh — часы в виде 2-х цифр, mm — минуты в виде 2-х цифр, ss — секунды в виде 2-х цифр.
en: There are the following abbreviations in all formats: h — hours without leading zero, hh — hours in the form of 2 digits, mm — minutes in the form of 2 digits, ss — seconds in the form of 2 digits.

source: Во избежание длительных блокировок timeout можно ограничить параметром "Время жизни на время транзакции при неактивности".
en: To avoid long-lasting data lock, timeout can be limited by "Idle-in-transaction timeout" parameter.

source: Возвращаемое значение может иметь типы: boolean, number, string, Date, undefined.
en: The returned value can have the following types: boolean, number, string, Date, undefined.

source: Возвращает квадратный корень аргумента.
en: Returns the argument square root.

source: Возвращает сумму аргументов.
en: Returns the sum of arguments.

source: Возвращает Аргумент без ведомых пробелов.
en: Returns the Argument without trailing spaces.

source: Возвращает Аргумент без ведущих и ведомых пробелов.
en: Returns the Argument without leading and trailing spaces.

source: Возвращает Аргумент без ведущих пробелов.
en: Returns the Argument without leading spaces.

source: Возвращает Вх.Строка, в которой НомерЧасти-ое вхождение выражения Рег.Выр.
en: Returns the InputString in which the PartNumber expression occurrence of the RegularExpression

source: Возвращает Вх.Строка, в которой все вхождения выражения Рег.Выр.
en: Returns the InputString in which all occurrences of the RegularExpression expression

source: Возвращает Значение1, если Условие истинно или Значение2, если ложно.
en: Returns Value1 if the Antecedent is true or Value2 if it is false.

source: Возвращает Ном.Вхожд-й адрес сайта из строки Вх.Строка не включая www до домена 1-го уровня включительно.
en: Returns OccurencesNumber site address from the InputString string, not including www till the top level domain, inclusively.

source: Возвращает абсолютную погрешность двух аргументов.
en: Returns the absolute error of two arguments.

source: Возвращает аргумент в верхнем регистре.
en: Returns the uppercase argument.

source: Возвращает аргумент в заданной степени.
en: Returns the argument in the given degree.

source: Возвращает аргумент в нижнем регистре.
en: Returns the lowercase argument.

source: Возвращает арккосинус значения, т.е. угол в радианах, косинус которого равен Значение.
en: Returns the value arccosine, namely, the angle in radians the cosine of which is equal to the Value.

source: Возвращает арксинус значения, т.е. угол в радианах, синус которого равен Значение.
en: Returns the value arcsine, namely, the angle in radians the sinus of which is equal to the Value.

source: Возвращает арктангенс значения, т.е. угол в радианах, тангенс которого равен Значение.
en: Returns the value arctangent, namely, the angle in radians the tangent of which is equal to the Value.

source: Возвращает год по заданной дате.
en: Returns the year according to the specified date.

source: Возвращает годовую амортизацию имущества для указанного периода.
en: Returns the annual property depreciation for the specified period.

source: Возвращает группу части строки, соответствующую регулярному выражению.
en: Returns the string part group matching the regular expression.

source: Возвращает день недели заданной даты.
en: Returns the week day according to the specified date.

source: Возвращает день по заданной дате.
en: Returns the day according to the specified date.

source: Возвращает дробную часть Аргумента.
en: Returns the fractional part of the Argument.

source: Возвращает заданное количество пробелов.
en: Returns the given count of spaces..

source: Возвращает заданное количество символов левой части строки.
en: Returns the given count of characters of the left string part.

source: Возвращает заданное количество символов правой части строки.
en: Returns the given count of characters of the right string part.

source: Возвращает знак аргумента.
en: Returns the argument sign.

source: Возвращает значение Выражения, если оно не равно Null, и Значение\_по\_умолчанию в противном случае.
en: Returns the Expression value if it is not equal to Null, and Default\_value otherwise.

source: Возвращает значение константы "ПИ" 3.1415926535897932385.
en: Returns the pi constant value 3.1415926535897932385.

source: Возвращает значение типа number.
en: It returns the value of the number type.

source: Возвращает кол-во частей строки, соответствующих регулярному выражению.
en: Returns the number of the string parts matching the regular expression.

source: Возвращает количество символов в строке.
en: Returns count of characters in the string.

source: Возвращает косинус заданного угла.
en: Returns cosine of the set angle.

source: Возвращает логарифм аргумента с заданным основанием.
en: Returns the argument logarithm with the given basis.

source: Возвращает логическое значение.
en: Returns the logical value.

source: Возвращает максимальное из аргументов.
en: Returns the maximum argument.

source: Возвращает месяц по заданной дате.
en: Returns the month according to the specified date.

source: Возвращает минимальное из аргументов.
en: Returns the minimum argument.

source: Возвращает минуты по заданной дате/времени.
en: Returns minutes according to the specified date/time.

source: Возвращает модуль аргумента.
en: Returns the absolute value of argument.

source: Возвращает натуральный логарифм аргумента.
en: Returns the natural argument logarithm.

source: Возвращает номер недели в году по заданной дате в соответствии со стандартом ISO 8601, по которому неделя начинается с понедельника и заканчивается воскресеньем.
en: Returns the week number of the year by the set date according to ISO 8601 standard subject to which the week starts from Monday and ends with Sunday.

source: Возвращает обратное гамма-распределение для интегральной функции, равной (1 - односторонняя вероятность распределения хи-квадрат).
en: Returns inverse gamma distribution for the integral function equal to (1 - one-sided probability of Chi-square distribution).

source: Возвращает объект, реализующий интерфейс IColumns (см.
en: It returns the object implementing the IColumns interface (refer to

source: Возвращает объект, реализующий интерфейс IVariableItems (см.
en: It returns the object implementing the IVariableItems interface (refer to

source: Возвращает одностороннюю вероятность распределения хи-квадрат.
en: Returns one-sided probability of Chi-square distribution.

source: Возвращает остаток от целочисленного деления Делимого на Делитель.
en: Returns remainder from integer division of the Dividend by the Divisor.

source: Возвращает относительную погрешность двух аргументов.
en: Returns the relative error of two arguments.

source: Возвращает подстроку из строки - источника, начиная с позиции Начало длиной Длина.
en: Returns substring from string - source, starting from the Start position of the Length length.

source: Возвращает полное количество дней между двумя датами.
en: Returns the total number of days between two dates.

source: Возвращает полное количество лет между двумя датами.
en: Returns the total number of years between two dates.

source: Возвращает полное количество месяцев между двумя датами.
en: Returns the total number of months between two dates.

source: Возвращает псевдослучайное равномерно распределенное число, большее или равное 0 и меньше 1.
en: Returns pseudorandom evenly distributed number larger or equal to 0 and less than 1.

source: Возвращает секунды по заданной дате/времени.
en: Returns seconds according to the specified date/time.

source: Возвращает символ Unicode по его коду.
en: Returns Unicode character according to its code.

source: Возвращает синус заданного угла.
en: Returns sinus of the set angle.

source: Возвращает список выражений в заданном формате.
en: Returns the list of expressions in the given format.

source: Возвращает среднее арифметическое аргументов.
en: Returns the arithmetic mean of arguments.

source: Возвращает стандартное отклонение аргументов.
en: Returns the standard deviation of arguments.

source: Возвращает строковое представление Аргумента с учетом локали.
en: Returns the Argument as a string taking into account locales.

source: Возвращает строковое представление аргумента Дата.
en: Returns the string representation of the Date argument

source: Возвращает строковое представление аргумента Дата\_время.
en: Returns the string representation of the Date\_time argument.

source: Возвращает строку - повторяющую заданную строку необходимое количество раз.
en: Returns a string - repeating the given string as many times as necessary.

source: Возвращает строку следующего вида.
en: Returns the string of the following type.

source: Возвращает сумму квадратов аргументов.
en: Returns the sum of squared arguments.

source: Возвращает тангенс заданного угла.
en: Returns tangent of the set angle.

source: Возвращает текущую дату и время.
en: Returns the current date and time.

source: Возвращает текущую дату.
en: Returns the current date.

source: Возвращает факториал аргумента.
en: Returns the argument factorial.

source: Возвращает целую часть Аргумента.
en: Returns the integer part of the Argument.

source: Возвращает час по заданной дате/времени.
en: Returns the hour according to the specified date/time.

source: Возвращает часть строки, соответствующую регулярному выражению.
en: Returns the string part matching the regular expression.

source: Возвращает число e в заданной степени.
en: Returns e constant in the given degree.

source: Возвращают одно значение, характеризующее это множество.
en: They return one value that is characteristic of such set.

source: Возможна фильтрация по категории и названию функции.
en: It is possible to filter by the function category and name.

source: Возможно переобучение модели, унаследованной из базового узла.
en: Model overfitting inherited from the base node is possible.

source: Возможно использование параметров в запросах в синтаксисе 1С.
en: It is possible to use parameters in requests in 1С syntax.

source: Возможно подключение как через клиент СУБД, так и через внутренний драйвер Loginom.
en: It is possible to provide connection both via DBMS client, and the internal Loginom driver.

source: Возможности и ограничения у разных портов различаются:
en: Different ports have different options and constraints:

source: Возможности отключить их видимость нет.
en: It is not possible to disable their visibility.

source: Возможности фильтрации, изменения формата отображения данных и поиска нет.
en: Filtration, change of data view format and search are not available.

source: Возможны варианты преобразования в следующие типы данных:
en: Options of transformation into the following data types are possible:

source: Возможны следующие варианты:
en: The following options are possible:

source: Возможны следующие положения кластеров:
en: The following positions of clusters are possible:

source: Возможны следующие способы задать итерации цикла:
en: There are the following methods used to set the loop iterations:

source: Возможные варианты назначения полей.
en: The following options of the fields usage types are possible:

source: Возможные значения портов задаются в числовом формате в интервале от 0 до 65535
en: Possible port values are set in the numeric format in the interval from 0 to 65535

source: Возможные значения:
en: Possible values:

source: Возраст
en: Age

source: Возьмем второй пример из замены по точному совпадению:
en: Let's consider the second example from replacement by exact match:

source: Возьмем первый пример из замены по точному совпадению:
en: Let's consider the first example of replacement by exact match:

source: Восстановление пропусков, когда пропуски образуют отдельную метку интервала квантования или объединяются с соседним, близким по значению WoE-индекса.
en: Null data recovery when null data forms a separate binning range caption, or it is joined with the nearest one that is close by the WoE coefficient value.

source: Восхитительно
en: Perfect

source: Временным рядом могут быть любые данные в разрезе времени, например, продажи товаров, количество заказов, поток клиентов и т.д.
en: Time series can be any data from the time perspective, for example, sale of goods, number of purchase orders, customer traffic, etc.

source: Время обработки — разница между началом и концом процесса обработки.
en: Process time — difference between start and finish of processing.

source: Вс
en: Sunday

source: Все выражения Результат вычисляются до сравнения Выражения со Значениями
en: All Result expressions are calculated before the Expression and Values comparison.

source: Все выражения РезультатN вычисляются до сравнения Выражения с ЗначениеN.
en: All ResultN expressions are calculated before the Expression and ValueN comparison.

source: Все действия с проектом в Loginom осуществляются в рамках Пакета, который является минимальной единицей поставки и представляет собой контейнер для компонентов, сценариев, подключений и т.д.
en: All actions with the project in Loginom must be performed within the Package that is a minimum delivery unit and has the form of a container for components, workflows, connections, etc.

source: Все документы из столбца должны соответствовать подключенной XSD-схеме.
en: All documents from the column must comply with the connected XSD schema.

source: Все основные настройки осуществляются либо через пункты контекстного меню (нажать правой кнопкой мыши в области диаграммы), либо с помощью кнопок на панели инструментов (сверху над диаграммой).
en: All main settings are available either using the context menu options (it is required to press the chart area with the right mouse button), or the toolbar buttons (in the upper part over the chart).

source: Все параметры пользователей, за исключением параметра Пароль, отображаются в таблице подраздела.
en: All user parameters are displayed in the subsection table, with the exception of Password parameter.

source: Все перечисленные команды доступны и в контекстном меню (правая кнопка мыши).
en: All listed commands are also available in the contex menu (the right mouse button).

source: Все поля исходного набора данных, независимо от назначения поля.
en: All fields of the source data set, irrespective of the field usage type.

source: Все поля исходного набора данных.
en: All fields of the source data set.

source: Все связи разом можно удалить с помощью кнопки Удалить все связиУдалить все связи, либо с помощью команды контекстного меню Удалить все связиУдалить все связи, вызванного на любом из элементов списке.
en: All links can be deleted at once using Delete all linksDelete all links button, or using the context menu command - Delete all linksDelete all links called in any of the list items.

source: Все созданные дочерние узлы можно удалить нажав на кнопку Удалит все...Удалить все... (комбинация горячих клавиш Shift+Delete).
en: It is possible to delete all created child nodes by pressing Delete all...Delete all... button (hotkeys combination - Shift+Delete).

source: Все узлы
en: All nodes

source: Все это позволяет создавать и сопровождать сложные проекты, а также делегировать решение выделенных подзадач.
en: It allows for development and support of complex projects. It also helps to delegate solution of the selected subtasks.

source: Всегда 0
en: Always 0

source: Всего
en: Total

source: Всего примеров
en: Total samples

source: Всего отобранных примеров
en: Total selected samples

source: Всего отобранных примеров (TotalSelectedSamples)
en: Total selected samples (TotalSelectedSamples)

source: Всего примеров (TotalSamples)
en: Total samples (TotalSamples)

source: Вспомогательные данные:
en: Supplementary data:

source: Вставляемая\_строка - строковое выражение.
en: Inserted\_string - string expression.

source: Вт
en: Tuesday

source: Второй вариант с вводом параметров подключения вручную, параметры в строке указываются через двоеточие.
en: When the second option based on the manual entering of parameters is used, it is required to provide the colon separated parameters in the string.

source: Вх.Строка - входная строка, в которой будет искаться Email-адрес;
en: InputString - the input string in which Email-address will be searched.

source: Вх.Строка - входная строка, которая будет подвержена замене;
en: InputString - the input string that will be replaced.

source: Вход
en: Input

source: Входная таблица должна содержать соответствующие данные, их описание приведено в таблице:
en: The input table must contain corresponding data. It is described in the table:

source: Входная таблица:
en: Input table:

source: Входное (внешнее разбиение) — появляется, если задан порт Внешние диапазоны квантования.
en: Input (external binning): it appears if External binning ranges port is set.

source: Входное (замороженное) — появляется после первого выполнения и обучения узла Конечные классы.
en: Input (locked): it appears upon the first execution and training of the Coarse Classes node.

source: Входное — значения поля будут использоваться как входные.
en: Input: the field values will be used as the input ones.

source: Входной источник данных:
en: Input data source:

source: Входной набор данных делится на два выходных набора (таблицы данных): записи, удовлетворяющие условию фильтрации, и записи, не удовлетворяющие условию.
en: The input data set is divided into two output data sets (data tables): the records that meet the filtering criterion and the records that do not meet the criterion.

source: Входной набор представляет данные, которые порт принимает.
en: The input data set represents the data that is accepted by the port.

source: Входные порты подмодели задают структуру запроса к сервису, а выходные — структуру ответа.
en: The input supernode ports set the service request structure, whereas the output ones set the response structure.

source: Входные данные - это транзакции, сформированные в 2 поля, одно из которых является транзакцией, а второе - элементом.
en: Input data means the transactions generated in 2 fields one of which is a transaction, whereas the second one is an item.

source: Входные данные должны соответствовать следующим требованиям:
en: The input data must meet the following requirements:

source: Входные и выходные поля будут связаны, если у них совпадают имена и тип данных.
en: The input and output fields will be linked, if their names and data types coincide.

source: Входные и выходные порты
en: Input and output ports

source: Входные и выходные порты задаются пользователем.
en: Input and output ports are set by a user.

source: Входные порты
en: Input Ports

source: Входные порты на пиктограмме узла Сценария располагаются слева, а выходные справа.
en: The input ports are located to the left on the Workflow node icon, and the output ones - to the right.

source: Входные порты на пиктограмме узла сценария располагаются слева, а выходные справа (см.
en: The input ports are located to the left on the workflow node icon, and the output ones - to the right (refer to

source: Входом и выходом обработчика являются входные и выходные порты.
en: The handler input and output are input and output ports.

source: Входом и выходом узла являются входные и выходные порты.
en: The node input and output are input and output ports.

source: Входы узла могут настраиваться автоматически (при подключении связи) или вручную.
en: The node inputs can be automatically (when providing a link) or manually configured.

source: Выберем в разделе Импорт компонент Текстовый файл и перенесем его в область построения (см.
en: Select the Text file component in the Import section and transfer it to the construction area (refer to

source: Выбирается в диапазоне от 0 до 3.
en: It is selected in the range from 0 to 3.

source: Выбор данного режима влияет на быстродействие БД, без синхронизации повышая быстродействие с наименьшей защищенностью от сбоев, и с уменьшением быстродействия в счет наибольшей защищенности от сбоев.
en: Selection of this mode affects the DB speed. It increases the speed without synchronization providing the lowest degree of protection against failures and decreasing the speed in order to provide higher degree of protection against failures.

source: Выбор диаграммы
en: Chart Type

source: Выбор метода запроса
en: Selection of the request method

source: Выбор объекта хранилища данных
en: Select Data Warehouse Object

source: Выбор одного из вариантов:
en: It is required to select one of the options:

source: Выбор одного из этих вариантов поведения узла при интерактивном выполнении Сценариев задается:
en: Selection of one of these options of the node behaviour in the case of the interactive execution of the Workflows is set as follows:

source: Выбор одного из этих вариантов поведения узла при пакетном выполнении задается:
en: Selection of one of these options of the node behaviour in the case of the batch processing is set as follows:

source: Выбор опорного значения происходит из таблицы уникальных значений.
en: The reference value is selected from the unique values table.

source: Выбор отображения переключается кнопками (см.
en: Display selection is switched by buttons (refer to

source: Выбор полей для кластеризации:
en: Select fields for clustering:

source: Выбор типа запроса (GET или POST), а так же определение списка параметров GET-запроса осуществляется при настройке этого подключения.
en: The request type (GET or POST) is selected, and the GET request parameters are listed when this connection is configured.

source: Выбор узла цикла
en: Selection of the Loop Node

source: Выбор узлов дерева
en: Selection of the Tree Nodes

source: Выбрав На значение и введя в строку Вне оценочного диапазона, получим результат
en: Having selected With value option and having entered into Out of estimation range row, the following result will be recieved:

source: Выбрав необходимое поле, а затем нажав на кнопку Гистограмма, в правой части интерфейса открывается дополнительное окно с расширенными настройками и более подробным описанием гистограммы (см.
en: When selecting the required field and pressing Histogram button, the additional window with advanced settings and more detailed description of histogram is opened in the right part of the interface (refer to

source: Выбранные поля
en: Selected Fields

source: Выбранные поля объединяются и присоединяются к набору данных согласно проставленному сопоставлению.
en: The selected fields are united and joined to the data set according to the set mapping.

source: Выбранные элементы
en: Selected Items

source: Выбранный объект будет использован для сравнения.
en: The selected object will be used for comparison.

source: Выбранный путь можно быстро скопировать кнопкой Копировать.
en: The selected path can be quickly copied using Copy button.

source: Выбрать необходимый пакет в списке Опубликованные пакеты мастера Публикация пакетов… и нажать кнопку Удалить.
en: Select the required package in Published packages list of Publish packages… wizard and press Delete button.

source: Выбрать элемент для связи и в колонке Связанные поля щелкнуть левой кнопкой мыши по его ячейке.
en: It is required to select the item to be linked, and left-click on its cell in the Related fields column.

source: Вывод в консоль:
en: Outputting to the console:
